sriharimaddula/ble-sdk6-examples/SDK_6.0.24.1464/DA145xx_SDK/6.0.24.1464/projects/target_apps/prod_test/prod_test/src/dialog_commands.c
/**
 ****************************************************************************************
 *
 * @file dialog_commands.c
 *
 * @brief dialog vendor specific command handlers project source code.
 *
 * Copyright (C) 2017-2025 Renesas Electronics Corporation and/or its affiliates.
 * All rights reserved. Confidential Information.
 *
 * This software ("Software") is supplied by Renesas Electronics Corporation and/or its
 * affiliates ("Renesas"). Renesas grants you a personal, non-exclusive, non-transferable,
 * revocable, non-sub-licensable right and license to use the Software, solely if used in
 * or together with Renesas products. You may make copies of this Software, provided this
 * copyright notice and disclaimer ("Notice") is included in all such copies. Renesas
 * reserves the right to change or discontinue the Software at any time without notice.
 *
 * THE SOFTWARE IS PROVIDED "AS IS". RENESAS DISCLAIMS ALL WARRANTIES OF ANY KIND,
 * WHETHER EXPRESS, IMPLIED, OR STATUTORY, INCLUDING BUT NOT LIMITED TO THE WARRANTIES
 * OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NON-INFRINGEMENT. TO THE
 * MAXIMUM EXTENT PERMITTED UNDER LAW, IN NO EVENT SHALL RENESAS BE LIABLE FOR ANY DIRECT,
 * INDIRECT, SPECIAL, INCIDENTAL OR CONSEQUENTIAL DAMAGES ARISING FROM, OUT OF OR IN
 * CONNECTION WITH THE SOFTWARE, EVEN IF RENESAS HAS BEEN ADVISED OF THE POSSIBILITY OF
 * SUCH DAMAGES. USE OF THIS SOFTWARE MAY BE SUBJECT TO TERMS AND CONDITIONS CONTAINED IN
 * AN ADDITIONAL AGREEMENT BETWEEN YOU AND RENESAS. IN CASE OF CONFLICT BETWEEN THE TERMS
 * OF THIS NOTICE AND ANY SUCH ADDITIONAL LICENSE AGREEMENT, THE TERMS OF THE AGREEMENT
 * SHALL TAKE PRECEDENCE. BY CONTINUING TO USE THIS SOFTWARE, YOU AGREE TO THE TERMS OF
 * THIS NOTICE.IF YOU DO NOT AGREE TO THESE TERMS, YOU ARE NOT PERMITTED TO USE THIS
 * SOFTWARE.
 *
 ****************************************************************************************
 */

 /*
 * INCLUDE FILES
 ****************************************************************************************
 */

#include "stdio.h"
#include "dialog_commands.h"
#include "hci_int.h"
#include "hci.h"
#include "co_hci.h"
#include "rwip.h"
#include "sdk_version.h"
#include "user_config_sw_ver.h"
#include "dialog_prod.h"
#ifndef __DA14531__
#include "rdtest_api.h"
#include "adc.h"
#endif
#include "user_periph_setup.h"
#include "otp_hdr.h"
#include "system_library.h"
#include "em_map.h"
#include "h4tl.h"
#include "uart.h"
#if defined (__DA14531__)
#include "Xtal_TRIM.h"
#endif
#include "llm.h"
#include "timer0.h"
#include "timer2.h"
#include "timer0_2.h"
#include "arch.h"
#include "arch_system.h"
#include "spi.h"
#include "i2c.h"

#if defined (__DA14531__)
#include "rf_531.h"
#endif

/*
 * DEFINES
 ****************************************************************************************
 */

// Value to generate 1s timeout when checking for a rising edge on the input pulse
#define PULSE_TIMEOUT    0x8CB6

// Maximum number of words that can be read or written by a command at once
#define MAX_READ_WRITE_OTP_WORDS 60

/*
 * GLOBAL VARIABLE DEFINITIONS
 ****************************************************************************************
 */

volatile uint8_t test_data_pattern;
volatile uint8_t test_freq;

/// Configuration struct for SPI bus.
static spi_cfg_t spi_cfg = {
    /// SPI master/slave mode
    .spi_ms = SPI_MS_MODE_MASTER,
    /// SPI clock mode (CPOL, CPHA)
    .spi_cp = SPI_CP_MODE_0,
    /// SPI master clock frequency
    .spi_speed = SPI_SPEED_MODE_2MHz,
    /// SPI word size (1, 2, 4 Bytes or 9 bits)
    .spi_wsz = SPI_MODE_8BIT,
    /// SPI master CS mode
    .spi_cs = SPI_CS_0,
    /// SPI Interrupt mode
    .spi_irq = SPI_IRQ_DISABLED,
    /// SPI CS Pad
    .cs_pad = {
        .port = GPIO_PORT_0,
        .pin = GPIO_PIN_1,
    },
#if (SPI_DMA_SUPPORT)
    /// SPI send callback
    .send_cb = ,
    /// SPI receive callback
    .receive_cb = ,
    /// SPI transfer callback
    .transfer_cb = ,
    /// SPI DMA Channel Pair Configuration
    .spi_dma_channel = ,
    /// SPI DMA Priority Configuration
    .spi_dma_priority = ,
#endif // SPI_DMA_SUPPORT
#ifdef __DA14531__
    /// SPI Capture at current or next edge.
    .spi_capture = SPI_MASTER_EDGE_CAPTURE,
#endif
};

/// Configuration struct for I2C bus.
static i2c_cfg_t i2c_cfg = {
    .clock_cfg.ss_hcnt = I2C_SS_SCL_HCNT_REG_RESET,
    .clock_cfg.ss_lcnt = I2C_SS_SCL_LCNT_REG_RESET,
    .clock_cfg.fs_hcnt = I2C_FS_SCL_HCNT_REG_RESET,
    .clock_cfg.fs_lcnt = I2C_FS_SCL_LCNT_REG_RESET,
    .restart_en = I2C_RESTART_ENABLE,
    .speed = I2C_SPEED_FAST,
    .mode = I2C_MODE_MASTER,
    .addr_mode = I2C_ADDRESSING_7B,
    .address = 0x00,
    .tx_fifo_level = 1,
    .rx_fifo_level = 1,
};

/*
 * LOCAL FUNCTIONS DECLARATIONS
 ****************************************************************************************
 */
extern uint32_t lp_clk_sel;
extern void uart_finish_transfers_func(void);
static uint8_t hci_otp_rd_data_cmd_cmp_evt_pk(uint8_t *out, uint8_t *in, uint16_t* out_len, uint16_t in_len);
static uint8_t hci_wr_otp_cmd_upk(uint8_t *out, uint8_t *in, uint16_t* out_len, uint16_t in_len);
static uint8_t hci_pack_bytes(uint8_t** pp_in, uint8_t** pp_out, uint8_t* p_in_end, uint8_t* p_out_end, uint8_t len);

// HCI dialog command descriptors (OGF Vendor Specific)
const struct hci_cmd_desc_tag hci_cmd_desc_tab_dialog_vs[] =
{
    CMD(CUSTOM_ACTION            , DBG, 0, PK_GEN_GEN, "B"                    , "LLL"                          ),
    CMD(SLEEP_TEST               , DBG, 0, PK_GEN_GEN, "BBB"                  , NULL                           ),
    CMD(XTAL_TRIM                , DBG, 0, PK_GEN_GEN, "3B"                   , "H"                            ),
    CMD(OTP_RW                   , DBG, 0, PK_GEN_GEN, "B6B"                  , "B6B"                          ),
    CMD(OTP_READ                 , DBG, 0, PK_GEN_SPE, "HB"                   , &hci_otp_rd_data_cmd_cmp_evt_pk),
    CMD(OTP_WRITE                , DBG, 0, PK_SPE_GEN, &hci_wr_otp_cmd_upk    , "BB"                           ),
    CMD(REGISTER_RW              , DBG, 0, PK_GEN_GEN, "BLL"                  , "BBL"                          ),
    CMD(AUDIO_TEST               , DBG, 0, PK_GEN_GEN, NULL                   , NULL                           ),
    CMD(FIRMWARE_VERSION_GET     , DBG, 0, PK_GEN_GEN, NULL                   , "66B"                          ),
    CMD(CHANGE_UART_PINS_ACTION  , DBG, 0, PK_GEN_GEN, "4B"                   , "H"                            ),
    CMD(RDTESTER                 , DBG, 0, PK_GEN_GEN, "BH"                   , NULL                           ),
    CMD(TX_TEST                  , DBG, 0, PK_GEN_GEN, "BBBBB"                , NULL                           ),
    CMD(START_PROD_RX_TEST       , DBG, 0, PK_GEN_GEN, "B"                    , NULL                           ),
    CMD(END_PROD_RX_TEST         , DBG, 0, PK_GEN_GEN, NULL                   , "HHHH"                         ),
    CMD(UNMODULATED_ON           , DBG, 0, PK_GEN_GEN, "BB"                   , NULL                           ),
    CMD(TX_START_CONTINUE_TEST   , DBG, 0, PK_GEN_GEN, "BB"                   , NULL                           ),
    CMD(TX_END_CONTINUE_TEST     , DBG, 0, PK_GEN_GEN, NULL                   , NULL                           ),
    CMD(SENSOR_TEST              , DBG, 0, PK_GEN_GEN, "17B"                  , "H"                            ),
    CMD(GPIO_SET                 , DBG, 0, PK_GEN_GEN, "6B"                   , "B"                            ),
    CMD(GPIO_READ                , DBG, 0, PK_GEN_GEN, "B"                    , "B"                            ),
    CMD(UART_LOOP                , DBG, 0, PK_GEN_GEN, "100B"                 , "100B"                         ),
    CMD(UART_BAUD                , DBG, 0, PK_GEN_GEN, "B"                    , "B"                            ),
    CMD(EXT32KHz_TEST            , DBG, 0, PK_GEN_GEN, NULL                   , "B"                            ),
    CMD(GPIO_WD                  , DBG, 0, PK_GEN_GEN, "2B"                   , "B"                            ),
    CMD(SLEEP_CLK_SEL            , DBG, 0, PK_GEN_GEN, "B"                    , "B"                            ),
    CMD(ADC_VBAT                 , DBG, 0, PK_GEN_GEN, "B"                    , "H"                            ),
#if defined (__DA14531__)
    CMD(SET_TX_POWER             , DBG, 0, PK_GEN_GEN, "B"                    , "B"                            ),
    CMD(CONFIGURE_TEST_MODE      , DBG, 0, PK_GEN_GEN, "B"                    , "B"                            ),
    CMD(RESET_MODE               , DBG, 0, PK_GEN_GEN, "B"                    , "B"                            ),
#endif
    CMD(PLATFORM_RESET           , DBG, 0, PK_GEN_GEN, "NULL"                 , "B"                            ),
};

const uint8_t dialog_commands_num = ARRAY_LEN (hci_cmd_desc_tab_dialog_vs);

/**
 ****************************************************************************************
 * @brief Handles the reception of the ADC read VBAT value command.
 *
 * @param[in] msgid Id of the message received (probably unused).
 * @param[in] param Pointer to the parameters of the message.
 * @param[in] dest_id ID of the receiving task instance (probably unused).
 * @param[in] src_id ID of the sending task instance.
 *
 * @return If the message was consumed or not.
 ****************************************************************************************
 */
static int dialog_commands_adc_vbat_handler(ke_msg_id_t const msgid,
                                                 struct hci_adc_vbat_dialog_cmd const *param,
                                                 ke_task_id_t const dest_id,
                                                 ke_task_id_t const src_id)
{
    // Structure type for the complete command event.
    struct hci_adc_vbat_dialog_cmd_cmp_evt *event =
        KE_MSG_ALLOC(HCI_CMD_CMP_EVENT, src_id, HCI_ADC_VBAT_CMD_OPCODE, hci_adc_vbat_dialog_cmd_cmp_evt);

#if defined (__DA14531__)
    event->vbat_lvl = (uint16_t) adc_531_get_vbat_sample(param->vbat_type);
#else
    adc_offset_calibrate(ADC_INPUT_MODE_SINGLE_ENDED);
    if (GetBits16(ANA_STATUS_REG, BOOST_SELECTED) == 0x1)
    {
        // Boost mode
        event->vbat_lvl = (uint16_t) adc_get_vbat_sample(true);
    }
    else
    {
        // Buck mode
        event->vbat_lvl = (uint16_t) adc_get_vbat_sample(false);
    }
#endif

    hci_send_2_host(event);

    return (KE_MSG_CONSUMED);
}

/**
 ****************************************************************************************
 * @brief Handles the reception of the default_command_custom_action dialog hci command.
 *
 * @param[in] msgid Id of the message received (probably unused).
 * @param[in] param Pointer to the parameters of the message.
 * @param[in] dest_id ID of the receiving task instance (probably unused).
 * @param[in] src_id ID of the sending task instance.
 *
 * @return 0 if the message was handled, -1 otherwise
 ****************************************************************************************
 */
static int dialog_default_commands_custom_action_handler(ke_msg_id_t const msgid,
                                                 struct hci_custom_action_dialog_cmd const *param,
                                                 ke_task_id_t const dest_id,
                                                 ke_task_id_t const src_id)
{
    uint32_t returnData;

    switch (param->inputData & 0x00FF)
    {
        /* Command 0x5F is used for UART resync test. */
        case 0x5F:
            returnData = param->inputData & 0x00FF;
            break;
        case 0x33:
            returnData = GetWord16(CLK_FREQ_TRIM_REG);
            break;
    /*
        Users can place their one-word response commands here or create a new handler
        case 0xYY:
            break;
    */

        default:
            return -1;
    }
    
    // structure type for the complete command event
    struct hci_custom_action_default_dialog_cmd_cmp_evt *event = KE_MSG_ALLOC(HCI_CMD_CMP_EVENT , src_id, HCI_CUSTOM_ACTION_CMD_OPCODE, hci_custom_action_default_dialog_cmd_cmp_evt);
    
    event->returnData = returnData;
    hci_send_2_host(event);
    
