sriharimaddula/ble-sdk6-examples/SDK_6.0.24.1464/DA145xx_SDK/6.0.24.1464/projects/target_apps/prod_test/prod_test/src/dialog_commands.c
    return 0;
}

#ifdef __DA14531__
#ifdef CFG_ENABLE_KDCO_RECALIBRATION
extern uint32_t rf_prod_test_kdco_get_current_value(void);
extern uint32_t rf_prod_test_kdco_recalibration(bool apply_value);
static int dialog_kdco_calibration_command_custom_action_handler(ke_msg_id_t const msgid,
                                                                 struct hci_custom_action_dialog_cmd const *param,
                                                                 ke_task_id_t const dest_id,
                                                                 ke_task_id_t const src_id)
{
    if((param->inputData & 0x00FF) == 0xAA)
    {
        // structure type for the complete command event
        struct hci_custom_action_dialog_kdco_calibration_cmd_cmp_evt *event = KE_MSG_ALLOC(HCI_CMD_CMP_EVENT , src_id, HCI_CUSTOM_ACTION_CMD_OPCODE, hci_custom_action_dialog_kdco_calibration_cmd_cmp_evt);

        // Fill the return values
        event->return_calculated_KDCO_value = rf_prod_test_kdco_recalibration(true);
        event->return_current_KDCO_value = rf_prod_test_kdco_get_current_value();
        event->return_status = param->inputData & 0x00FF;

        hci_send_2_host(event);
        return 0;
    }

    return -1;
}
#endif // CFG_ENABLE_KDCO_RECALIBRATION

#ifdef CFG_ENABLE_RC32M_RECALIBRATION
#include "otp_cs.h"
#include "rc32m_cal.h"

extern otp_cs_t otp_cs;
extern otp_cs_booter_val_t booter_val;

bool rc32m_current_value_recovered = false;
uint32_t rc32m_otp_value;
static int dialog_rc32m_calibration_command_custom_action_handler(ke_msg_id_t const msgid,
                                                                  struct hci_custom_action_dialog_cmd const *param,
                                                                  ke_task_id_t const dest_id,
                                                                  ke_task_id_t const src_id)
{
    if((param->inputData & 0x00FF) == 0xBB)
    {
        // Save the RC32M calibration value from the OTP CS
        if(!rc32m_current_value_recovered) {
            rc32m_otp_value = booter_val.clk_rc32m_reg;
            rc32m_current_value_recovered = true;
        }

        // structure type for the complete command event
        struct hci_custom_action_dialog_rc32m_calibration_cmd_cmp_evt *event = KE_MSG_ALLOC(HCI_CMD_CMP_EVENT , src_id, HCI_CUSTOM_ACTION_CMD_OPCODE, hci_custom_action_dialog_rc32m_calibration_cmd_cmp_evt);

        // Fill the return values
        event->return_calculated_RC32M_value = rc32m_cal_execute();
        event->return_current_RC32M_value = rc32m_otp_value;
        event->return_status = param->inputData & 0x00FF;

        // Replace the cs value with the newly calibrated value
        booter_val.clk_rc32m_reg = GetWord16(CLK_RC32M_REG);

        hci_send_2_host(event);
        return 0;
    }

    return -1;
}
#endif // CFG_ENABLE_RC32M_RECALIBRATION
#endif // __DA14531__

const ke_msg_func_t dialog_custom_commands_handler_tab[] = 
{
    (ke_msg_func_t)dialog_default_commands_custom_action_handler,
#ifdef __DA14531__
  #ifdef CFG_ENABLE_KDCO_RECALIBRATION
    (ke_msg_func_t)dialog_kdco_calibration_command_custom_action_handler,
  #endif // CFG_ENABLE_KDCO_RECALIBRATION

  #ifdef CFG_ENABLE_RC32M_RECALIBRATION
    (ke_msg_func_t)dialog_rc32m_calibration_command_custom_action_handler,
  #endif // CFG_ENABLE_RC32M_RECALIBRATION
#endif // __DA14531__
};

/**
 ****************************************************************************************
 * @brief Handles the reception of the custom_action dialog hci command.
 *
 * @param[in] msgid Id of the message received (probably unused).
 * @param[in] param Pointer to the parameters of the message.
 * @param[in] dest_id ID of the receiving task instance (probably unused).
 * @param[in] src_id ID of the sending task instance.
 *
 * @return If the message was consumed or not.
 ****************************************************************************************
 */
static int dialog_commands_custom_action_handler(ke_msg_id_t const msgid,
                                                 struct hci_custom_action_dialog_cmd const *param,
                                                 ke_task_id_t const dest_id,
                                                 ke_task_id_t const src_id)
{
    uint16_t func_num = sizeof(dialog_custom_commands_handler_tab)/sizeof(dialog_custom_commands_handler_tab[0]);
    uint16_t i;
    bool handled = false;

    for(i = 0; i < func_num; i++) {
        // Call all the custom handlers until one that handles this command is found
        if(dialog_custom_commands_handler_tab[i](msgid, param, dest_id, src_id) == 0) {
            handled = true;
            break;
        }
    }

    // If the message was not handled, return a default one word response
    if(!handled) {
        // structure type for the complete command event
        struct hci_custom_action_default_dialog_cmd_cmp_evt *event = KE_MSG_ALLOC(HCI_CMD_CMP_EVENT , src_id, HCI_CUSTOM_ACTION_CMD_OPCODE, hci_custom_action_default_dialog_cmd_cmp_evt);
    
        event->returnData = param->inputData & 0x00FF;
        hci_send_2_host(event);
    }

    return KE_MSG_CONSUMED;
}

/**
 ****************************************************************************************
 * @brief Handles the reception of the audio_test dialog hci command.
 *
 * @param[in] msgid Id of the message received (probably unused).
 * @param[in] param Pointer to the parameters of the message.
 * @param[in] dest_id ID of the receiving task instance (probably unused).
 * @param[in] src_id ID of the sending task instance.
 *
 * @return If the message was consumed or not.
 ****************************************************************************************
 */
static int dialog_commands_audio_test_handler(ke_msg_id_t const msgid,
                                              void const *param,
                                              ke_task_id_t const dest_id,
                                              ke_task_id_t const src_id)
{
    // structure type for the complete command event
    void *event = ke_msg_alloc(HCI_CMD_CMP_EVENT , src_id, HCI_AUDIO_TEST_CMD_OPCODE, 0);

    hci_send_2_host(event);
    return (KE_MSG_CONSUMED);
}

/**
 ****************************************************************************************
 * @brief Handles the reception of the firmware_version dialog hci command.
 *
 * @param[in] msgid Id of the message received (probably unused).
 * @param[in] param Pointer to the parameters of the message.
 * @param[in] dest_id ID of the receiving task instance (probably unused).
 * @param[in] src_id ID of the sending task instance.
 *
 * @return If the message was consumed or not.
 ****************************************************************************************
 */
static int dialog_commands_firmware_version_get_handler(ke_msg_id_t const msgid,
                                                        void const *param,
                                                        ke_task_id_t const dest_id,
                                                        ke_task_id_t const src_id)
{
    // structure type for the complete command event
    struct hci_firmware_version_get_dialog_cmd_cmp_evt *event = KE_MSG_ALLOC(HCI_CMD_CMP_EVENT , src_id, HCI_FIRMWARE_VERSION_GET_CMD_OPCODE, hci_firmware_version_get_dialog_cmd_cmp_evt);

    //adding return values
    event->ble_ver_len = sizeof(SDK_VERSION);
    strcpy(event->ble_ver, SDK_VERSION);

    event->app_ver_len = sizeof(DA14585_REFDES_SW_VERSION);
    strcpy(event->app_ver, DA14585_REFDES_SW_VERSION);

    hci_send_2_host(event);
    return (KE_MSG_CONSUMED);
}

/**
 ****************************************************************************************
 * @brief Handles the reception of the change_uart_pins_action dialog hci command.
 *
 * @param[in] msgid Id of the message received (probably unused).
 * @param[in] param Pointer to the parameters of the message.
 * @param[in] dest_id ID of the receiving task instance (probably unused).
 * @param[in] src_id ID of the sending task instance.
 *
 * @return If the message was consumed or not.
 ****************************************************************************************
 */
static int dialog_commands_change_uart_pins_action_handler(ke_msg_id_t const msgid,
                                                           struct hci_change_uart_pins_action_dialog_cmd const *param,
                                                           ke_task_id_t const dest_id,
                                                           ke_task_id_t const src_id)
{
    // Structure type for the complete command event
    struct hci_change_uart_pins_action_dialog_cmd_cmp_evt *event = KE_MSG_ALLOC(HCI_CMD_CMP_EVENT , src_id, HCI_CHANGE_UART_PINS_ACTION_CMD_OPCODE, hci_change_uart_pins_action_dialog_cmd_cmp_evt);
    uint8_t data[4];
    data[0] = param->tx_port;
    data[1] = param->tx_pin;
    data[2] = param->rx_port;
    data[3] = param->rx_pin;
    // Check if new pins are valid
    event->status = check_uart_pins_cmd(data);
    // Send completion event
    hci_send_2_host(event);

    // Change to new pins if they are valid
    if (!event->status)
    {
        change_uart_pins_cmd(data);
    }

    return (KE_MSG_CONSUMED);
}

/**
 ****************************************************************************************
 * @brief Handles the reception of the register_rw dialog hci command.
 *
 * @param[in] msgid Id of the message received (probably unused).
 * @param[in] param Pointer to the parameters of the message.
 * @param[in] dest_id ID of the receiving task instance (probably unused).
 * @param[in] src_id ID of the sending task instance.
 *
 * @return If the message was consumed or not.
 ****************************************************************************************
 */
static int dialog_commands_register_rw_handler(ke_msg_id_t const msgid,
                                               struct hci_register_rw_dialog_cmd const *param,
                                               ke_task_id_t const dest_id,
                                               ke_task_id_t const src_id)
{
    // structure type for the complete command event
    struct hci_register_rw_dialog_cmd_cmp_evt *event = KE_MSG_ALLOC(HCI_CMD_CMP_EVENT , src_id, HCI_REGISTER_RW_CMD_OPCODE, hci_register_rw_dialog_cmd_cmp_evt);

    volatile void * reg_addr = 0;

