sriharimaddula/ble-sdk6-examples/SDK_6.0.24.1464/DA145xx_SDK/6.0.24.1464/projects/target_apps/prod_test/prod_test/src/dialog_commands.c
    event->operation = param->operation;
    event->reserved = 0;

    reg_addr = (volatile void *)(param->addr);
    switch(param->operation)
    {
    case CMD__REGISTER_RW_OP_READ_REG32:
        event->data = GetWord32(reg_addr);
        break;
    case CMD__REGISTER_RW_OP_WRITE_REG32:
        SetWord32(reg_addr, param->data );
        break;
    case CMD__REGISTER_RW_OP_READ_REG16:
        event->data = GetWord16(reg_addr);
        break;
    case CMD__REGISTER_RW_OP_WRITE_REG16:
        SetWord16(reg_addr, param->data );
        break;
    default:
        break;
    }

    hci_send_2_host(event);
    return (KE_MSG_CONSUMED);
}

/**
 ****************************************************************************************
 * @brief Handles the reception of the tx_start_continue_test dialog hci command.
 *
 * @param[in] msgid Id of the message received (probably unused).
 * @param[in] param Pointer to the parameters of the message.
 * @param[in] dest_id ID of the receiving task instance (probably unused).
 * @param[in] src_id ID of the sending task instance.
 *
 * @return If the message was consumed or not.
 ****************************************************************************************
 */
static int dialog_commands_tx_start_continue_test_handler(ke_msg_id_t const msgid,
                                                          struct hci_tx_start_continue_test_dialog_cmd const *param,
                                                          ke_task_id_t const dest_id,
                                                          ke_task_id_t const src_id)
{
    // structure type for the complete command event
    void *event = ke_msg_alloc(HCI_CMD_CMP_EVENT , src_id, HCI_TX_START_CONTINUE_TEST_CMD_OPCODE, 0);

    test_freq = param->frequency;
    test_data_pattern = param->payload_type;
    set_state_start_continue_tx();

    hci_send_2_host(event);
    return (KE_MSG_CONSUMED);
}

/**
 ****************************************************************************************
 * @brief Handles the reception of the otp_rw dialog hci command.
 *
 * @param[in] msgid Id of the message received (probably unused).
 * @param[in] param Pointer to the parameters of the message.
 * @param[in] dest_id ID of the receiving task instance (probably unused).
 * @param[in] src_id ID of the sending task instance.
 *
 * @return If the message was consumed or not.
 ****************************************************************************************
 */
static int dialog_commands_otp_rw_handler(ke_msg_id_t const msgid,
                                          struct hci_otp_rw_dialog_cmd const *param,
                                          ke_task_id_t const dest_id,
                                          ke_task_id_t const src_id)
{
    // structure type for the complete command event
    struct hci_otp_rw_dialog_cmd_cmp_evt *event = KE_MSG_ALLOC(HCI_CMD_CMP_EVENT , src_id, HCI_OTP_RW_CMD_OPCODE, hci_otp_rw_dialog_cmd_cmp_evt);
    uint32_t word[2];

    memset(word, 0, sizeof(word));
    event->operation = param->operation;

    switch(param->operation)
    {
#if !defined (__DA14531__)
    case CMD__OTP_OP_RD_XTRIM:
        otp_read(OTP_HDR_TRIM_XTAL16M_ADDR, event->data , 2);
        break;

    case CMD__OTP_OP_WR_XTRIM:
        word[0] = param->data[0] | param->data[1] << 8 ;
        otp_write_words(OTP_HDR_TRIM_XTAL16M_OFFSET, word , 1);
        break;
#else
//DO NOTHING IN 531
#endif //!defined (__DA14531__)

    case CMD__OTP_OP_RD_BDADDR:
        otp_read(OTP_HDR_BDADDR_ADDR, event->data , 6);
        break;
    case CMD__OTP_OP_WR_BDADDR:
        word[0] = ((param->data[3] << 24) | (param->data[2] << 16) | (param->data[1] << 8) | (param->data[0]));
        word[1] = ( param->data[5] << 8 | param->data[4] );
#if defined (__DA14531__)
        otp_write_words(OTP_HDR_BDADDR_OFFSET, word , 2);
#else
        otp_write_words(OTP_HDR_BDADDR_OFFSET, word , 1);
#endif
        break;
    case CMD__OTP_OP_RE_XTRIM:
        //DO NOTHING IN 585
        break;

    case CMD__OTP_OP_WE_XTRIM:
        //DO NOTHING IN 585
        break;

    default:
        break;
    }

    hci_send_2_host(event);
    return (KE_MSG_CONSUMED);
}

/**
 ****************************************************************************************
 * @brief Handles the reception of the xtal_trim dialog hci command.
 *
 * @param[in] msgid Id of the message received (probably unused).
 * @param[in] param Pointer to the parameters of the message.
 * @param[in] dest_id ID of the receiving task instance (probably unused).
 * @param[in] src_id ID of the sending task instance.
 *
 * @return If the message was consumed or not.
 ****************************************************************************************
 */
static int dialog_commands_xtal_trim_handler(ke_msg_id_t const msgid,
                                             struct hci_xtal_trim_dialog_cmd const *param,
                                             ke_task_id_t const dest_id,
                                             ke_task_id_t const src_id)
{
    // Structure type for the complete command event
    struct hci_xtal_trim_dialog_cmd_cmp_evt *event = KE_MSG_ALLOC(HCI_CMD_CMP_EVENT , src_id, HCI_XTAL_TRIM_CMD_OPCODE, hci_xtal_trim_dialog_cmd_cmp_evt);
    uint16_t reg_value;
    uint16_t delta = param->trim_MSB << 8|param->trim_LSB;
    uint8_t xtal_cal_status = 0;
    int value;
    uint16_t gpio_prev_mode = 0x0000;
    uint32_t port_reg;
    uint8_t gpio_sel;
    GPIO_PORT gpio_port;
    GPIO_PIN gpio_pin;
#if !defined (__DA14531__)
    int auto_trim(uint8_t port_number);
#endif

    switch(param->operation)
    {
    case CMD__XTRIM_OP_RD:
        event->trim_value = GetWord16(CLK_FREQ_TRIM_REG);
        break;
    case CMD__XTRIM_OP_WR:
        SetWord16(CLK_FREQ_TRIM_REG, delta);
        event->trim_value = 0x00;
        break;
    case CMD__XTRIM_OP_EN:
#if !defined (__DA14531__)
        SetWord32(TEST_CTRL_REG, 1);
        SetWord16(P05_MODE_REG, OUTPUT | PID_GPIO);
#else
        if (GetBits16(SYS_CTRL_REG, DEBUGGER_ENABLE) == 1) {
            // Debugger must be disabled before P05 is used as clock output.
            while (GetBits16(SYS_STAT_REG, DBG_IS_UP) != 0);
            SetBits16(SYS_CTRL_REG, DEBUGGER_ENABLE, 0);
        }

        SetWord16(P05_MODE_REG, OUTPUT | PID_SYS_CLK);
#endif
        event->trim_value = 0x00;
        break;
    case CMD__XTRIM_OP_INC:
        reg_value = GetWord16(CLK_FREQ_TRIM_REG);
#if !defined (__DA14531__)
        if (reg_value <= 0xFFFF - delta)
#else
        if (reg_value <= 0xFF - delta)
#endif
        {
            SetWord16(CLK_FREQ_TRIM_REG, reg_value + delta);
        }
        event->trim_value = 0x00;
        break;
    case CMD__XTRIM_OP_DEC:
        reg_value = GetWord16(CLK_FREQ_TRIM_REG);
        if (reg_value >= delta)
        {
            SetWord16(CLK_FREQ_TRIM_REG, reg_value - delta);
        }
        event->trim_value = 0x00;
        break;
    case CMD__XTRIM_OP_DIS:
#if !defined (__DA14531__)
        SetWord32(TEST_CTRL_REG, 0);
#endif
        SetWord16(P05_MODE_REG, INPUT_PULLDOWN | PID_GPIO);
        event->trim_value = 0x00;
        break;
    case CMD__XTRIM_OP_CALTEST:
    case CMD__XTRIM_OP_CAL:
    {
        /* Check for pulse in Rx option.*/
        if (param->trim_LSB == 0xFE)
        {
            bool rx_pin_found = false;

            gpio_port = GPIO_PORT_0;
            gpio_pin = GPIO_PIN_0;

#if defined(__DA14531__)
    const GPIO_PORT MAX_GPIO_PORT = GPIO_PORT_0;
    const GPIO_PIN MAX_GPIO_PIN[] = {GPIO_PIN_11};
#else
    const GPIO_PORT MAX_GPIO_PORT = GPIO_PORT_3;
    const GPIO_PIN MAX_GPIO_PIN[] = {GPIO_PIN_7, GPIO_PIN_5, GPIO_PIN_9, GPIO_PIN_7};
#endif

