sriharimaddula/ble-sdk6-examples/SDK_6.0.24.1464/DA145xx_SDK/6.0.24.1464/projects/target_apps/prod_test/prod_test/src/dialog_commands.c
            // initialize in case the GPIO is not found.
            gpio_sel = 0xFF;

            // Find the UART2 RX pin
            while (!rx_pin_found && ((gpio_port <= MAX_GPIO_PORT) && (gpio_pin <= MAX_GPIO_PIN[gpio_port])))
            {
                gpio_sel = gpio_port*10 + gpio_pin; // Applies for all IC...
                port_reg = find_mode_register(gpio_sel);
                rx_pin_found = ((GetWord16(port_reg) & 0x0F) == FUNC_UART_RX);

                if (rx_pin_found)
                {
                    // GPIO found.
                    break;
                }

#if !defined (__DA14531__)
                // Change port...
                if (gpio_pin == MAX_GPIO_PIN[gpio_port])
                {
                    gpio_port++;
                    gpio_pin = GPIO_PIN_0;
                    continue;
                }
#endif
                gpio_pin++;
            }

            if (!rx_pin_found)
            {
                gpio_sel = 0xFF;
            }
        }
        else
        {
            gpio_sel = param->trim_LSB;
#if defined (__DA14531__)
            gpio_port = GPIO_PORT_0;
            gpio_pin = (GPIO_PIN)gpio_sel;
#else
            gpio_port = (GPIO_PORT)(gpio_sel/10);
            gpio_pin = (GPIO_PIN)(gpio_sel%10);
#endif
        }

        // Get the register of the port
        port_reg = find_mode_register(gpio_sel);
        if (port_reg)
        {
            // Hold previous mode for the pin that will be used for the pulse.
            gpio_prev_mode = GetWord16(port_reg);

            handle_jtag(gpio_port, gpio_pin);
#if defined (__DA14531__)
            handle_reset_state(gpio_port, gpio_pin);
            unset_rst_line(gpio_port, gpio_pin);
#endif
            // Clear any previous role assigned to the pin and configured as GPIO with pull up.
            SetWord16(port_reg, INPUT_PULLUP | PID_GPIO);
#if defined (__DA14531__)
            value = auto_trim(param->trim_MSB, gpio_sel);
#else
            value = auto_trim(gpio_sel);
#endif
            // Pulse found in the pulse pin assigned GPIO was out of acceptable range
            if (value == -1)
            {
                xtal_cal_status = 0x01;
            }
            // No pulse found, or pulse > 740 ms
            else if (value == -2)
            {
                xtal_cal_status = 0x02;
            }
            else
            {
                if (param->operation == CMD__XTRIM_OP_CAL)
                {
                    uint32_t word[2];
                    memset(word, 0, sizeof(word));

                    // Write xtal trimming value in otp
                    word[0] = value & 0xFFFF;
#if !defined (__DA14531__)
                    int res;
                    res = otp_write_words(OTP_HDR_TRIM_XTAL16M_OFFSET, word, 1);
                    if (res != 0)
                    {
                        xtal_cal_status = 0x03;
                    }
#else
//DO NOTHING IN 531
#endif
                }
            }
        }
        else
        {
            xtal_cal_status = 0x04;
        }
        event->trim_value = xtal_cal_status;
        break;
    }
    default:
        break;
    }

    // Check if command is CMD__XTRIM_OP_CALTEST or CMD__XTRIM_OP_CAL to restore UART_RX pin
    if ((param->operation == CMD__XTRIM_OP_CALTEST) || (param->operation == CMD__XTRIM_OP_CAL))
    {
        // If pulse was generated on the UART Rx Pin, wait until the end of the pulse, to avoid UART collision.
        if (((gpio_prev_mode & PID) == PID_UART1_RX) || ((gpio_prev_mode & PID) == PID_UART2_RX))
        {
            // Set timeout.
            uint32_t timeout = 100*PULSE_TIMEOUT;
            // Wait until the pin gets high or timeout is reached.
            while(GPIO_GetPinStatus(gpio_port, gpio_pin) && (timeout-- != 0));

            // Reset timeout.
            timeout = 100*PULSE_TIMEOUT;
            // Wait until the pin gets high or timeout is reached.
            while(!GPIO_GetPinStatus(gpio_port, gpio_pin) && (timeout-- != 0));

            // Wait another 2ms before sending the response.
            arch_asm_delay_us(2000);
        }
    }
#if defined (__DA14531__)
    set_rst_line(gpio_port, gpio_pin);
#endif
    hci_send_2_host(event);

    // Check if command is CMD__XTRIM_OP_CALTEST or CMD__XTRIM_OP_CAL to restore UART_RX pin
    if ((param->operation == CMD__XTRIM_OP_CALTEST) || (param->operation == CMD__XTRIM_OP_CAL))
    {
        // If pulse was generated on the UART Rx Pin, wait until the end of the pulse, to avoid UART collision
        if (((gpio_prev_mode & PID) == PID_UART1_RX) || ((gpio_prev_mode & PID) == PID_UART2_RX))
        {
            // Timeout in 1sec
            uint16_t timeout = PULSE_TIMEOUT;
            // Wait until the pin gets high or timeout is reached
            while(!GPIO_GetPinStatus(gpio_port, gpio_pin) && (timeout-- != 0) );
            // Return pin to its previous mode
            if (port_reg != 0)
            {
                SetWord16(port_reg, gpio_prev_mode);
            }
        }
    }

    return (KE_MSG_CONSUMED);
}

/**
 ****************************************************************************************
 * @brief Handles the reception of the tx_start_continue_test dialog hci command.
 *
 * @param[in] msgid Id of the message received (probably unused).
 * @param[in] param Pointer to the parameters of the message.
 * @param[in] dest_id ID of the receiving task instance (probably unused).
 * @param[in] src_id ID of the sending task instance.
 *
 * @return If the message was consumed or not.
 ****************************************************************************************
 */
static int dialog_commands_tx_end_continue_test_handler(ke_msg_id_t const msgid,
                                                        void const *param,
                                                        ke_task_id_t const dest_id,
                                                        ke_task_id_t const src_id)
{
    // structure type for the complete command event
    void *event = ke_msg_alloc(HCI_CMD_CMP_EVENT , src_id, HCI_TX_END_CONTINUE_TEST_CMD_OPCODE, 0);

