sriharimaddula/ble-sdk6-examples/SDK_6.0.24.1464/DA145xx_SDK/6.0.24.1464/projects/target_apps/prod_test/prod_test/src/dialog_commands.c
    if (test_state == STATE_START_CONTINUE_TX)
    {
#if defined (__DA14531__)
        stop_refresh_timer();
#endif
        set_state_stop();
        SetWord32(BLE_RFTESTCNTL_REG,0);
        hci_send_2_host(event);
    }
    return (KE_MSG_CONSUMED);
}

/**
 ****************************************************************************************
 * @brief Handles the reception of the start_prod_rx_test dialog hci command.
 *
 * @param[in] msgid Id of the message received (probably unused).
 * @param[in] param Pointer to the parameters of the message.
 * @param[in] dest_id ID of the receiving task instance (probably unused).
 * @param[in] src_id ID of the sending task instance.
 *
 * @return If the message was consumed or not.
 ****************************************************************************************
 */
static int dialog_commands_start_prod_rx_test_handler(ke_msg_id_t const msgid,
                                                      struct hci_start_prod_rx_dialog_cmd const *param,
                                                      ke_task_id_t const dest_id,
                                                      ke_task_id_t const src_id)
{
    // structure type for the complete command event
    void *event = ke_msg_alloc(HCI_CMD_CMP_EVENT , src_id, HCI_START_PROD_RX_TEST_CMD_OPCODE, 0);

    test_freq = param->frequency;
    set_state_start_rx();

    hci_send_2_host(event);
    return (KE_MSG_CONSUMED);
}

/**
 ****************************************************************************************
 * @brief Handles the reception of the end_prod_rx_test dialog hci command.
 *
 * @param[in] msgid Id of the message received (probably unused).
 * @param[in] param Pointer to the parameters of the message.
 * @param[in] dest_id ID of the receiving task instance (probably unused).
 * @param[in] src_id ID of the sending task instance.
 *
 * @return If the message was consumed or not.
 ****************************************************************************************
 */
static int dialog_commands_end_prod_rx_test_handler(ke_msg_id_t const msgid,
                                                    void const *param,
                                                    ke_task_id_t const dest_id,
                                                    ke_task_id_t const src_id)
{
    // structure type for the complete command event
    struct hci_end_prod_rx_dialog_cmd_cmp_evt *event = KE_MSG_ALLOC(HCI_CMD_CMP_EVENT , src_id, HCI_END_PROD_RX_TEST_CMD_OPCODE, hci_end_prod_rx_dialog_cmd_cmp_evt);

    if (test_state == STATE_START_RX)
    {
        set_state_stop();
#ifdef CFG_BLE_METRICS
        event->rp = metrics.rx_pkt;
        event->rp_SYNC_error = metrics.rx_err_sync;
        event->rp_CRC_error = metrics.rx_err_crc;
        event->RSSI = metrics.rx_rssi;
#endif

        hci_send_2_host(event);
    }
    return (KE_MSG_CONSUMED);
}

/**
 ****************************************************************************************
 * @brief Handles the reception of the unmodulated_on dialog hci command.
 *
 * @param[in] msgid Id of the message received (probably unused).
 * @param[in] param Pointer to the parameters of the message.
 * @param[in] dest_id ID of the receiving task instance (probably unused).
 * @param[in] src_id ID of the sending task instance.
 *
 * @return If the message was consumed or not.
 ****************************************************************************************
 */
static int dialog_commands_unmodulated_on_handler(ke_msg_id_t const msgid,
                                                  struct hci_unmodulated_on_dialog_cmd const *param,
                                                  ke_task_id_t const dest_id,
                                                  ke_task_id_t const src_id)
{
    // structure type for the complete command event
    void *event = ke_msg_alloc(HCI_CMD_CMP_EVENT , src_id, HCI_UNMODULATED_ON_CMD_OPCODE, 0);
    uint16_t cn;
    bool cmd_flag =false;

    switch(param->operation)
    {
    case UNMODULATED_CMD_MODE_OFF: //UNMODULATED OFF
#if !defined (__DA14531__)
        SetWord16(RF_BMCW_REG, 0);              //DISABLE OVERRULE CN_SEL IS 0
        SetWord16(RF_OVERRULE_REG, 0);          // SO DS IS NOT CORRECT, DISABLE DONE BY WRITING '0' TO ENABLE ISO '1' TO DISABLE
        SetWord16(RF_SYNTH_CTRL3_REG, 0x0003);  //ENABLE MODULATION
#else
        stop_refresh_timer();
        switch (test_state) {
        case STATE_UNMODULATED_RX_ON:
            set_state_stop();
            SetBits32(BLE_RFTESTCNTL_REG,INFINITERX, 0);
            break;
        case STATE_UNMODULATED_ON:
            SetWord32(RF_OVERRULE_REG, 0);
            rf_adplldig_deactivate();
            break;
        default:
            break;
        }
#endif

        NVIC_EnableIRQ(BLE_RF_DIAG_IRQn);
        NVIC_ClearPendingIRQ(BLE_RF_DIAG_IRQn); //clear eventual pending bit, but not necessary becasuse this is already cleared automatically in HW
        cmd_flag=true;
        test_state = STATE_IDLE;
        break;

    case UNMODULATED_CMD_MODE_TX: //UNMODULATED TX
        NVIC_DisableIRQ(BLE_RF_DIAG_IRQn);

        cn = param->frequency;

#if !defined (__DA14531__)

# if (LUT_PATCH_ENABLED)
        const volatile struct LUT_CFG_struct *pLUT_CFG; // = (const volatile struct LUT_CFG_struct *)(jump_table_struct[lut_cfg_pos]);
        pLUT_CFG = &LUT_CFG;
        if(!pLUT_CFG->HW_LUT_MODE) //so SW_LUT_MODE
        {
            set_rf_cal_cap(cn);
            SetBits16(RF_BMCW_REG, CN_SEL,1);       // ENABLE OVERRULE CN_SEL IS 1
            SetBits16(RF_BMCW_REG, CN_WR, cn);
        }
        else //so HW_LUT_MODE
        {
            //HW
            uint8_t * BLE_freq_tbl;
            BLE_freq_tbl = (uint8_t *)(_ble_base + EM_FT_OFFSET); // = EM base address + Frequency Table offset
            SetBits16(RF_BMCW_REG, CN_SEL,1);                                 // ENABLE OVERRULE CN_SEL IS 1
            SetBits16(RF_BMCW_REG, CN_WR, BLE_freq_tbl[cn]);
        }
# else //NO LUT
        SetBits16(RF_BMCW_REG, CN_SEL,1);                                     // ENABLE OVERRULE CN_SEL IS 1
        SetBits16(RF_BMCW_REG, CN_WR, cn);
# endif

