sriharimaddula/ble-sdk6-examples/SDK_6.0.24.1464/DA145xx_SDK/6.0.24.1464/projects/target_apps/prod_test/prod_test/src/dialog_commands.c
    event->num_of_words = length;

    hci_send_2_host(event);
    return (KE_MSG_CONSUMED);
}

/**
 ****************************************************************************************
 * @brief Handles the reception of the otp_write dialog hci command.
 *
 * @param[in] msgid Id of the message received (probably unused).
 * @param[in] param Pointer to the parameters of the message.
 * @param[in] dest_id ID of the receiving task instance (probably unused).
 * @param[in] src_id ID of the sending task instance.
 *
 * @return If the message was consumed or not.
 ****************************************************************************************
 */
static int dialog_commands_otp_write_handler(ke_msg_id_t const msgid,
                                             struct hci_otp_write_dialog_cmd const *param,
                                             ke_task_id_t const dest_id,
                                             ke_task_id_t const src_id)
{
    // structure type for the complete command event
    struct hci_otp_write_dialog_cmd_cmp_evt *event = KE_MSG_ALLOC(HCI_CMD_CMP_EVENT , src_id, HCI_OTP_WRITE_CMD_OPCODE, hci_otp_write_dialog_cmd_cmp_evt);

    uint32_t length = 0;
    uint32_t init_addr = 0;
    uint8_t *data_buf;
    uint32_t i = 0;
    uint32_t word[2];
    memset(word, 0, sizeof(word));

    length = param->num_of_words;
    data_buf = (uint8_t*)&param->wordbyte[0];
    init_addr = param->start_addr;

    /* Check that data length is null or bigger than 60*/
    if ((length == 0) || (length > MAX_READ_WRITE_OTP_WORDS))
    {
        event->status = CO_ERROR_INVALID_HCI_PARAM;
    }
    else
    {
#ifdef __DA14531__
         for (i = 0; i < length ; i ++)
         {
             word[0] =  data_buf[(i*4)+3] << 24 | data_buf[(i*4)+2] << 16 | data_buf[(i*4)+1] << 8 | data_buf[(i*4)];
             otp_write_words( init_addr, word , 1);
             init_addr += 4;
         }
#else
         for (i = 0; i < length ; i += 2)
         {
             word[0] =  data_buf[(i*4)+3] << 24 | data_buf[(i*4)+2] << 16 | data_buf[(i*4)+1] << 8 | data_buf[(i*4)];
             word[1] =  data_buf[(i*4)+7] << 24 | data_buf[(i*4)+6] << 16 | data_buf[(i*4)+5] << 8 | data_buf[(i*4)+4];
             otp_write_words( init_addr, word , 1);
             init_addr += 8;
         }
#endif
         event->status = CO_ERROR_NO_ERROR;
    }
    event->num_of_words = param->num_of_words;

    hci_send_2_host(event);
    return (KE_MSG_CONSUMED);
}

/**
 ****************************************************************************************
 * @brief Handles the reception of the sensor_test dialog hci command.
 *
 * @param[in] msgid Id of the message received (probably unused).
 * @param[in] param Pointer to the parameters of the message.
 * @param[in] dest_id ID of the receiving task instance (probably unused).
 * @param[in] src_id ID of the sending task instance.
 *
 * @return If the message was consumed or not.
 ****************************************************************************************
 */
static int dialog_commands_sensor_test_handler(ke_msg_id_t const msgid,
                                               struct hci_sensor_test_dialog_cmd const *param,
                                               ke_task_id_t const dest_id,
                                               ke_task_id_t const src_id)
{
    // structure type for the complete command event
    struct hci_sensor_test_dialog_cmd_cmp_evt *event = KE_MSG_ALLOC(HCI_CMD_CMP_EVENT , src_id, HCI_SENSOR_TEST_CMD_OPCODE, hci_sensor_test_dialog_cmd_cmp_evt);

#if defined (__DA14531__)
    _reset_options prev_rst_op = reset_mode;
#endif

    switch(param->interface)
    {
    case 0: // SPI
    {
        uint16_t mode_reg_clk_gpio = 0;
        uint16_t mode_reg_di_gpio = 0;
        uint16_t mode_reg_do_gpio = 0;
        uint16_t mode_reg_cs_gpio = 0;
        uint16_t mode_reg_int_gpio = 0;

        // Verify GPIO selection.
        if ((!GPIO_is_valid((GPIO_PORT)param->spi_clk_or_i2c_port, (GPIO_PIN)param->spi_clk_or_i2c_pin)) ||         // CLK
            (!GPIO_is_valid((GPIO_PORT)param->spi_di_or_i2c_sda_port, (GPIO_PIN)param->spi_di_or_i2c_sda_pin)) ||   // MISO
            (!GPIO_is_valid((GPIO_PORT)param->spi_do_port, (GPIO_PIN)param->spi_do_pin)) ||                         // MOSI
            (!GPIO_is_valid((GPIO_PORT)param->spi_cs_port, (GPIO_PIN)param->spi_cs_pin)) ||                         // CS
            (param->int_gpio_check && (!GPIO_is_valid((GPIO_PORT)param->int_port, (GPIO_PIN)param->int_pin))))      // INT GPIO
        {
            event->data = 0xFF;
            break;
        }

        // JTAG
        {
            handle_jtag((GPIO_PORT)param->spi_clk_or_i2c_port, (GPIO_PIN)param->spi_clk_or_i2c_pin);
            handle_jtag((GPIO_PORT)param->spi_di_or_i2c_sda_port, (GPIO_PIN)param->spi_di_or_i2c_sda_pin);
            handle_jtag((GPIO_PORT)param->spi_do_port, (GPIO_PIN)param->spi_do_pin);
            handle_jtag((GPIO_PORT)param->spi_cs_port, (GPIO_PIN)param->spi_cs_pin);
            if (param->int_gpio_check)
            {
                handle_jtag((GPIO_PORT)param->int_port, (GPIO_PIN)param->int_pin);
            }
        }

#if defined (__DA14531__)
        // Handle hw_reset function
        {
            if ((param->spi_clk_or_i2c_port == GPIO_PORT_0      &&  param->spi_clk_or_i2c_pin == GPIO_PIN_0)    ||  // CLK
                (param->spi_di_or_i2c_sda_port == GPIO_PORT_0   &&  param->spi_di_or_i2c_sda_pin == GPIO_PIN_0) ||  // MISO
                (param->spi_do_port == GPIO_PORT_0              &&  param->spi_do_pin == GPIO_PIN_0)            ||  // MOSI
                (param->spi_cs_port == GPIO_PORT_0              &&  param->spi_cs_pin == GPIO_PIN_0)            ||  // CS
                (param->int_gpio_check && (param->int_port == GPIO_PORT_0 && param->int_pin == GPIO_PIN_0)))        // INT_GPIO
            {
                reset_mode = ENABLE_POR_RESET;
                // Update reset state.
                set_hw_reset();
            }
        }
#endif

        // Retain previous GPIO modes.
        {
            uint32_t reg_val = 0;

            if ((reg_val = find_mode_register(param->spi_clk_or_i2c_pin)) != 0)
            {
                mode_reg_clk_gpio = GetWord16(reg_val);
            }
            if ((reg_val = find_mode_register(param->spi_di_or_i2c_sda_pin)) != 0)
            {
                mode_reg_di_gpio = GetWord16(reg_val);
            }
            if ((reg_val = find_mode_register(param->spi_do_pin)) != 0)
            {
                mode_reg_do_gpio = GetWord16(reg_val);
            }
            if ((reg_val = find_mode_register(param->spi_cs_pin)) != 0)
            {
                mode_reg_cs_gpio = GetWord16(reg_val);
            }
            if ((reg_val = find_mode_register(param->int_pin)) != 0)
            {
                mode_reg_int_gpio = GetWord16(reg_val);
            }
        }

        // Set parameters in main structs.
        spi_cfg.cs_pad.port = (GPIO_PORT)param->spi_cs_port;
        spi_cfg.cs_pad.pin = (GPIO_PIN)param->spi_cs_pin;

        // Initialize SPI block.
        spi_initialize(&spi_cfg);

