sriharimaddula/ble-sdk6-examples/SDK_6.0.24.1464/DA145xx_SDK/6.0.24.1464/projects/target_apps/prod_test/prod_test/src/dialog_commands.c
        // set_pad_spi.
        {
            // CLK
            GPIO_ConfigurePin((GPIO_PORT) param->spi_clk_or_i2c_port, (GPIO_PIN) param->spi_clk_or_i2c_pin, OUTPUT, PID_SPI_CLK, false);
            // MISO
            GPIO_ConfigurePin((GPIO_PORT) param->spi_di_or_i2c_sda_port, (GPIO_PIN) param->spi_di_or_i2c_sda_pin, INPUT, PID_SPI_DI, false);
            // MOSI
            GPIO_ConfigurePin((GPIO_PORT) param->spi_do_port, (GPIO_PIN) param->spi_do_pin, OUTPUT, PID_SPI_DO, false);
            // CS
            GPIO_ConfigurePin((GPIO_PORT) param->spi_cs_port, (GPIO_PIN) param->spi_cs_pin, OUTPUT, PID_SPI_EN, true);
        }

        // Test operation.
        {
            // INT/DRDY.
            if (param->int_gpio_check)
            {
                GPIO_ConfigurePin((GPIO_PORT) param->int_port, (GPIO_PIN) param->int_pin, INPUT_PULLDOWN, PID_GPIO, false);
            }
            // Write.
            if (param->rw == 1)
            {
                sensor_spi_write_byte((uint16_t) param->register_address, param->register_data_write, (GPIO_PORT) param->spi_cs_port, (GPIO_PIN) param->spi_cs_pin);
            }
            systick_wait(30000);
            event->data = sensor_spi_read_byte((uint16_t) param->register_address, (GPIO_PORT) param->spi_cs_port, (GPIO_PIN) param->spi_cs_pin);

            if (param->int_gpio_check)
            {
                arch_asm_delay_us(300);
                event->data = GPIO_GetPinStatus((GPIO_PORT) param->int_port, (GPIO_PIN) param->int_pin);
            }
        }

        // Restore GPIO modes.
        {
            uint32_t reg_val = 0;

            if ((reg_val = find_mode_register(param->spi_clk_or_i2c_pin)) != 0)
            {
                SetWord16(reg_val, mode_reg_clk_gpio);
            }
            if ((reg_val = find_mode_register(param->spi_di_or_i2c_sda_pin)) != 0)
            {
                SetWord16(reg_val, mode_reg_di_gpio);
            }
            if ((reg_val = find_mode_register(param->spi_do_pin)) != 0)
            {
                SetWord16(reg_val, mode_reg_do_gpio);
            }
            if ((reg_val = find_mode_register(param->spi_cs_pin)) != 0)
            {
                SetWord16(reg_val, mode_reg_cs_gpio);
            }
            if ((reg_val = find_mode_register(param->int_port)) != 0)
            {
                SetWord16(reg_val, mode_reg_int_gpio);
            }
        }
        // SPI release.
        spi_release();
        break;
    }
    case 1: // I2C
    {
        uint16_t mode_reg_scl_gpio = 0;
        uint16_t mode_reg_sda_gpio = 0;
        uint16_t mode_reg_int_gpio = 0;

        // Verify GPIO selection.
        if ((!GPIO_is_valid((GPIO_PORT)param->spi_di_or_i2c_sda_port, (GPIO_PIN)param->spi_di_or_i2c_sda_pin)) ||   // SDA
            (!GPIO_is_valid((GPIO_PORT)param->spi_clk_or_i2c_port, (GPIO_PIN)param->spi_clk_or_i2c_pin)) ||         // SCL
            (param->int_gpio_check && (!GPIO_is_valid((GPIO_PORT)param->int_port, (GPIO_PIN)param->int_pin))))      // INT GPIO
        {
            event->data = 0xFF;
            break;
        }

        // JTAG
        {
            handle_jtag((GPIO_PORT)param->spi_di_or_i2c_sda_port, (GPIO_PIN)param->spi_di_or_i2c_sda_pin);
            handle_jtag((GPIO_PORT)param->spi_clk_or_i2c_port, (GPIO_PIN)param->spi_clk_or_i2c_pin);
            if (param->int_gpio_check)
            {
                handle_jtag((GPIO_PORT)param->int_port, (GPIO_PIN)param->int_pin);
            }
        }

#if defined (__DA14531__)
        // Handle hw_reset function
        {
            if ((param->spi_di_or_i2c_sda_port == GPIO_PORT_0   &&  param->spi_di_or_i2c_sda_pin == GPIO_PIN_0) ||  // SDA
                (param->spi_clk_or_i2c_port == GPIO_PORT_0      &&  param->spi_clk_or_i2c_pin == GPIO_PIN_0)    ||  // SCL
                (param->int_gpio_check && (param->int_port == GPIO_PORT_0 && param->int_pin == GPIO_PIN_0)))        // INT GPIO
            {
                reset_mode = ENABLE_POR_RESET;
                // Update reset state.
                set_hw_reset();
            }
        }
#endif
        // Retain previous GPIO modes.
        {
            uint32_t reg_val = 0;

            if ((reg_val = find_mode_register(param->spi_clk_or_i2c_pin)) != 0)
            {
                mode_reg_scl_gpio = GetWord16(reg_val);
            }
            if ((reg_val = find_mode_register(param->spi_di_or_i2c_sda_pin)) != 0)
            {
                mode_reg_sda_gpio = GetWord16(reg_val);
            }
            if ((reg_val = find_mode_register(param->int_port)) != 0)
            {
                mode_reg_int_gpio = GetWord16(reg_val);
            }
        }

        // Set parameters in main struct.
        i2c_cfg.address = param->i2c_slave_address;

        // Configure I2C environment.
        i2c_init(&i2c_cfg);

        // set_pad_eeprom.
        {
            // I2C_SCL GPIO initialize.
            GPIO_SetPinFunction((GPIO_PORT) param->spi_clk_or_i2c_port, (GPIO_PIN) param->spi_clk_or_i2c_pin, INPUT, PID_I2C_SCL);
            // I2C_SDA GPIO initialize.
            GPIO_SetPinFunction((GPIO_PORT) param->spi_di_or_i2c_sda_port, (GPIO_PIN) param->spi_di_or_i2c_sda_pin, INPUT, PID_I2C_SDA);
        }

        // Test operation.
        {
            // INT/DRDY.
            if (param->int_gpio_check)
            {
                GPIO_ConfigurePin((GPIO_PORT) param->int_port, (GPIO_PIN) param->int_pin, INPUT_PULLDOWN, PID_GPIO, false);
            }

            // Write.
            if (param->rw == 1)
            {
                sensor_i2c_write_byte((uint32_t) param->register_address, param->register_data_write);
            }
            systick_wait(30000);
            event->data  = sensor_i2c_read_byte((uint32_t) param->register_address);

            if (param->int_gpio_check)
            {
                arch_asm_delay_us(300);
                event->data = GPIO_GetPinStatus((GPIO_PORT) param->int_port, (GPIO_PIN) param->int_pin);
            }
        }

        // Restore GPIOs.
        {
            uint32_t reg_val = 0;

            if ((reg_val = find_mode_register(param->spi_clk_or_i2c_pin)) != 0)
            {
                SetWord16(reg_val, mode_reg_scl_gpio);
            }
            if ((reg_val = find_mode_register(param->spi_di_or_i2c_sda_pin)) != 0)
            {
                SetWord16(reg_val, mode_reg_sda_gpio);
            }
            if ((reg_val = find_mode_register(param->int_port)) != 0)
            {
                SetWord16(reg_val, mode_reg_int_gpio);
            }
        }

        i2c_release();
        break;
    }
    default:
    {
        break;
    }
    }

#if defined (__DA14531__)
    // Restore reset state.
    reset_mode = prev_rst_op;
    set_hw_reset();
#endif

    // Restore option
    set_pad_functions();                                                                // Restore UART pins in case they are used in a sensor.
    // Send the answer.
    hci_send_2_host(event);

    return (KE_MSG_CONSUMED);
}

/**
 ****************************************************************************************
 * @brief Handles the reception of the gpio_set dialog hci command.
 *
 * @param[in] msgid Id of the message received (probably unused).
 * @param[in] param Pointer to the parameters of the message.
 * @param[in] dest_id ID of the receiving task instance (probably unused).
 * @param[in] src_id ID of the sending task instance.
 *
 * @return If the message was consumed or not.
 ****************************************************************************************
 */
static int dialog_commands_gpio_set_handler(ke_msg_id_t const msgid,
                                            struct hci_gpio_set_dialog_cmd const *param,
                                            ke_task_id_t const dest_id,
                                            ke_task_id_t const src_id)
{
    // structure type for the status event
    struct hci_gpio_set_dialog_cmd_cmp_evt *event = KE_MSG_ALLOC(HCI_CMD_CMP_EVENT ,src_id, HCI_GPIO_SET_CMD_OPCODE, hci_gpio_set_dialog_cmd_cmp_evt);
    uint8_t err = 0x00;
    GPIO_PORT port;
    GPIO_PIN pin;
    GPIO_PUPD mode = INPUT_PULLDOWN;
    uint8_t volt_rail;
    uint8_t state;
    uint8_t pwm;
    uint8_t duty_cycle;

