sriharimaddula/ble-sdk6-examples/SDK_6.0.24.1464/DA145xx_SDK/6.0.24.1464/projects/target_apps/prod_test/prod_test/src/dialog_commands.c
    /* Transform the input. */
#if defined(__DA14531__)
    port = GPIO_PORT_0;
    pin = (GPIO_PIN) (param->gpio_pad);
#else
    port = (GPIO_PORT) (param->gpio_pad / 10);
    pin = (GPIO_PIN) (param->gpio_pad % 10);
#endif
    volt_rail = param->gpio_lvl;

    /* Validate the GPIO voltage rail. 0 = 3.3V, 1 = 1.8V. */
    if (volt_rail > 1)
    {
        err = 1;
    }

    /* Validate the GPIO port/pin. */
    if (!GPIO_is_valid(port, pin))
    {
        err = 1;
    }

    handle_jtag((GPIO_PORT)port, (GPIO_PIN)pin);
#if defined (__DA14531__)
    // Disable hw_reset functionality.
    if ((port == GPIO_PORT_0) && (pin == GPIO_PIN_0))
    {
        GPIO_Disable_HW_Reset();
    }
#endif

    /* Check for error. Send error and return. */
    if (err)
    {
        event->error = 0xFF;
        hci_send_2_host(event);
        return (KE_MSG_CONSUMED);
    }

    WD_port = port;
    WD_pin = pin;
    WD_volt_rail = volt_rail;

    gpio_wd_timer0_start();

    hci_send_2_host(event);
    return (KE_MSG_CONSUMED);
}

/**
 ****************************************************************************************
 * @brief Handles the reception of the external 32KHz crystal dialog hci test command.
 *
 * @param[in] msgid Id of the message received (probably unused).
 * @param[in] param Pointer to the parameters of the message.
 * @param[in] dest_id ID of the receiving task instance (probably unused).
 * @param[in] src_id ID of the sending task instance.
 *
 * @return If the message was consumed or not.
 ****************************************************************************************
 */
static int dialog_commands_ext32khz_test_handler(ke_msg_id_t const msgid,
                                                 void const *param,
                                                 ke_task_id_t const dest_id,
                                                 ke_task_id_t const src_id)
{
    // Structure type for the complete command event.
    struct hci_ext32khz_test_dialog_cmd_cmp_evt *event = KE_MSG_ALLOC(HCI_CMD_CMP_EVENT, src_id, HCI_EXT32KHz_TEST_CMD_OPCODE, hci_ext32khz_test_dialog_cmd_cmp_evt);
    int k = 0;

#ifdef __DA14531__
    bool xtal_enabled = (GetBits16(CLK_XTAL32K_REG, XTAL32K_ENABLE) == 1);

    // Enable XTAL32K if not enabled.
    if (!xtal_enabled)
    {
        SetBits16(CLK_XTAL32K_REG, XTAL32K_ENABLE, 0x1); // Enables the 32kHz XTAL oscillator.
        SetBits16(CLK_XTAL32K_REG, XTAL32K_CUR, 5);
        SetBits16(CLK_XTAL32K_REG, XTAL32K_RBIAS, 3);

        arch_asm_delay_us(200000); // 200msec
    }

    if (GetBits16(CLK_XTAL32K_REG, XTAL32K_ENABLE) == 1)
#endif
    {
        // Calibration operation to understand if external 32KHz is mounted.
        SetBits16(CLK_REF_CNT_REG, REF_CNT_VAL, 1);
#ifdef __DA14531__
        SetBits16(CLK_REF_SEL_REG, EXT_CNT_EN_SEL, 0x00);
#endif
        SetBits16(CLK_REF_SEL_REG, REF_CLK_SEL, 0x2);   // XTAL32KHz select

        SetBits16(CLK_REF_SEL_REG, REF_CAL_START, 0x1); // Start calibration.

        k = 0;
        while ((GetBits16(CLK_REF_SEL_REG, REF_CAL_START) == 1) && (k<100)) {
            k++;
            arch_asm_delay_us(100); // 100usec
        }

        if (GetBits16(CLK_REF_SEL_REG, REF_CAL_START) == 1)
            event->error = 0xFF;
        else event->error = 0;
    }
#ifdef __DA14531__
    else
    {
        event->error = 0xFF;
    }
#endif

#ifdef __DA14531__
    // Restore XTAL32K state
    if (!xtal_enabled)
    {
        SetBits16(CLK_XTAL32K_REG, XTAL32K_ENABLE, 0x0);
    }
#endif

    hci_send_2_host(event);
    return (KE_MSG_CONSUMED);
}

/**
 ****************************************************************************************
 * @brief Handles the reception of the sleep clock selection dialog hci command.
 *
 * @param[in] msgid Id of the message received (probably unused).
 * @param[in] param Pointer to the parameters of the message.
 * @param[in] dest_id ID of the receiving task instance (probably unused).
 * @param[in] src_id ID of the sending task instance.
 *
 * @return If the message was consumed or not.
 ****************************************************************************************
 */
static int dialog_commands_sleep_clk_sel_handler(ke_msg_id_t const msgid,
                                                 struct hci_sleep_clk_sel_dialog_cmd const *param,
                                                 ke_task_id_t const dest_id,
                                                 ke_task_id_t const src_id)
{
    // Structure type for the complete command event.
    struct hci_sleep_clk_sel_dialog_cmd_cmp_evt *event = KE_MSG_ALLOC(HCI_CMD_CMP_EVENT, src_id, HCI_SLEEP_CLK_SEL_CMD_OPCODE, hci_sleep_clk_sel_dialog_cmd_cmp_evt);
    event->error = 0x00;

#if defined (__DA14531__)
//DO NOTHING IN 531
#else
    // LP_CLK_XTAL32
    if (param->sleep_clk == 0x1)
    {
        lp_clk_sel = LP_CLK_XTAL32;
        SetBits16(CLK_32K_REG, XTAL32K_ENABLE, 1);  // Enable XTAL32KHz

        // Disable XTAL32 amplitude regulation in BOOST mode
        if (GetBits16(ANA_STATUS_REG, BOOST_SELECTED) == 0x1)
            SetBits16(CLK_32K_REG,  XTAL32K_DISABLE_AMPREG, 1);
        else
            SetBits16(CLK_32K_REG,  XTAL32K_DISABLE_AMPREG, 0);
        SetBits16(CLK_32K_REG,  XTAL32K_CUR, 5);
        SetBits16(CLK_32K_REG,  XTAL32K_RBIAS, 3);
        SetBits16(SYS_CTRL_REG, CLK32_SOURCE, 1);  // Select XTAL32K as LP clock
    // LP_CLK_RCX20
    }else if (param->sleep_clk == 0x0)
    {
        lp_clk_sel = LP_CLK_RCX20;
        SetBits16(CLK_RCX20K_REG, RCX20K_NTC, 0xB);
        SetBits16(CLK_RCX20K_REG, RCX20K_BIAS, 0);
        SetBits16(CLK_RCX20K_REG, RCX20K_TRIM, 0);
        SetBits16(CLK_RCX20K_REG, RCX20K_LOWF, 1);
        SetBits16(CLK_RCX20K_REG, RCX20K_ENABLE, 1);
        SetBits16(CLK_RCX20K_REG, RCX20K_SELECT, 1);
        SetBits16(SYS_CTRL_REG, CLK32_SOURCE, 0); // Select RCX as LP clock
        rcx20_calibrate();
    }
    else event->error = 0xFF;
#endif

    hci_send_2_host(event);
    return (KE_MSG_CONSUMED);
}

static int dialog_commands_platform_reset_handler(ke_msg_id_t const msgid,
                                                  void const *param,
                                                  ke_task_id_t const dest_id,
                                                  ke_task_id_t const src_id)
{
    // Structure type for the status event.
    struct hci_platform_reset_cmd_cmp_evt *event = KE_MSG_ALLOC(HCI_CMD_CMP_EVENT, src_id, HCI_PLATFORM_RESET_CMD_OPCODE, hci_platform_reset_cmd_cmp_evt);

    event->error = 0;
    hci_send_2_host(event);

    SetWord16(RESET_FREEZE_REG, FRZ_WDOG);
    SetWord16(WATCHDOG_CTRL_REG, NMI_RST);
    SetWord16(WATCHDOG_REG, 5);
    // Wait for Watchdog to expire
    while (GetBits16(WATCHDOG_REG, WDOG_VAL));

    return (KE_MSG_CONSUMED);
}

#if defined (__DA14531__)

extern void rf_reinit(void);

static int dialog_commands_set_tx_power_handler(ke_msg_id_t const msgid,
                                                struct hci_set_tx_power_dialog_cmd const *param,
                                                ke_task_id_t const dest_id,
                                                ke_task_id_t const src_id)
{
    // Structure type for the status event.
    struct hci_set_tx_power_dialog_cmd_cmp_evt *event = KE_MSG_ALLOC(HCI_CMD_CMP_EVENT, src_id, HCI_SET_TX_POWER_CMD_OPCODE, hci_set_tx_power_dialog_cmd_cmp_evt);

    event->error = 0;

    hci_send_2_host(event);

    rf_pa_pwr_set((rf_tx_pwr_lvl_t)param->data);

    rf_reinit();    // Update radio and ADPLL settings

    return (KE_MSG_CONSUMED);
}

